[
  {
    "id": "001",
    "company_logo": "https://cdn.freebiesupply.com/logos/large/2x/google-1-1-logo-png-transparent.png",
    "job_title": "Software Engineer",
    "company_name": "Google LLC",
    "remote_or_onsite": "Remote",
    "location": "Dhaka, Bangladesh",
    "fulltime_or_parttime": "Full-time",
    "salary": "100k - 120k",
    "job_description": "We are looking for a Data Analyst to join our team and help us turn data into actionable insights. The ideal candidate should have experience working with large datasets, analyzing data using statistical methods, and creating data visualizations. In this role, you will collaborate with other teams to identify business needs and develop solutions that drive growth and innovation.",
    "job_responsibility": "Collect and analyze large datasets to identify trends and patterns. Interpret data and present findings to stakeholders. Develop and maintain data models and dashboards. Collaborate with other teams to identify business needs and develop solutions that drive growth and innovation.",
    "educational_requirements": "Bachelor's degree in Computer Science or related field",
    "experiences": "5+ years of experience in software engineering",
    "contact_information": {
      "phone": "123-456-7890",
      "email": "jobs@abccorp.com"
    }
  },
  {
    "id": "002",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Logonetflix.png/800px-Logonetflix.png",
    "job_title": "Marketing Manager",
    "company_name": "Netflix",
    "remote_or_onsite": "Onsite",
    "location": "New York, NY",
    "fulltime_or_parttime": "Full-time",
    "salary": "90k - 110k",
    "job_description": "We are seeking a Web Developer to join our team and help us build responsive and user-friendly web applications. The ideal candidate should have experience with modern web technologies such as HTML, CSS, JavaScript, and React. In this role, you will work closely with other developers and designers to create engaging web experiences for our clients.",
    "job_responsibility": "Design and develop web applications using modern web technologies such as HTML, CSS, JavaScript, and React. Collaborate with designers to create engaging and intuitive user interfaces. Write clean and efficient code that adheres to industry standards. Troubleshoot and debug issues as they arise.",
    "educational_requirements": "Bachelor's degree in Marketing, Business Administration or related field",
    "experiences": "7+ years of experience in marketing, with at least 3 years in a managerial role",
    "contact_information": {
      "phone": "123-456-7890",
      "email": "jobs@xyzcorp.com"
    }
  },
  {
    "id": "003",
    "company_logo": "https://www.freepnglogos.com/uploads/tesla-logo-png-20.png",
    "job_title": "UX Designer",
    "company_name": "Tesla",
    "remote_or_onsite": "Remote",
    "location": "Buffalo, US",
    "fulltime_or_parttime": "Full-time",
    "salary": "80k - 100k",
    "job_description": "We are seeking a Marketing Manager to lead our marketing team and drive the growth of our business. The ideal candidate should have experience in developing and executing marketing strategies across multiple channels, including digital, social media, and events. In this role, you will collaborate with other teams to identify business needs and develop campaigns that drive customer acquisition and retention.",
    "job_responsibility": "Lead the development and execution of marketing strategies across multiple channels, including digital, social media, and events. Collaborate with other teams to identify business needs and develop campaigns that drive customer acquisition and retention. Manage a team of marketing professionals to ensure the successful implementation of marketing plans. Analyze and report on the effectiveness of marketing campaigns.",
    "educational_requirements": "Bachelor's degree in Design, Human-Computer Interaction or related field",
    "experiences": "3+ years of experience in UX design",
    "contact_information": {
      "phone": "123-456-7890",
      "email": "jobs@123inc.com"
    }
  },
  {
    "id": "004",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Airbnb_Logo_B%C3%A9lo.svg/2560px-Airbnb_Logo_B%C3%A9lo.svg.png",
    "job_title": "Human Resources Manager",
    "company_name": "Airbnb LLC",
    "remote_or_onsite": "Onsite",
    "location": "New York, NY",
    "fulltime_or_parttime": "Full-time",
    "salary": "80k - 100k",
    "job_description": "We are seeking a Software Engineer to join our team and help us build scalable and reliable software systems. The ideal candidate should have experience with modern software development practices and technologies, such as Agile, DevOps, and Cloud Computing. In this role, you will work closely with other developers and engineers to design, implement, and test software solutions that meet our business needs.",
    "job_responsibility": "Design, implement, and test software solutions that meet business needs. Work collaboratively with other developers and engineers to design and implement high-quality software systems. Follow modern software development practices and technologies, such as Agile, DevOps, and Cloud Computing. Troubleshoot and debug issues as they arise.",
    "educational_requirements": "Bachelor's degree in Human Resources or related field",
    "experiences": "5+ years of experience in HR management",
    "contact_information": {
      "phone": "123-456-7890",
      "email": "jobs@xyzcorp.com"
    }
  },
  {
    "id": "005",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Logo_of_YouTube_%282015-2017%29.svg/502px-Logo_of_YouTube_%282015-2017%29.svg.png",
    "job_title": "Data Analyst",
    "company_name": "YouTube",
    "remote_or_onsite": "Onsite",
    "location": "Chicago, IL",
    "fulltime_or_parttime": "Full-time",
    "salary": "70k - 90k",
    "job_description": "We are seeking a talented Graphic Designer to join our team. The ideal candidate should have a strong portfolio demonstrating experience in creating visual designs across multiple channels, including digital, print, and social media. In this role, you will collaborate with other teams to understand business needs and create compelling designs that resonate with our target audience.",
    "job_responsibility": "Create visual designs across multiple channels, including digital, print, and social media. Collaborate with other teams to understand business needs and create compelling designs that resonate with our target audience. Present design concepts and collaborate with stakeholders to finalize designs. Stay up-to-date with industry trends and best practices.",
    "educational_requirements": "Bachelor's degree in Data Science, Statistics, or related field",
    "experiences": "2+ years of experience in data analysis",
    "contact_information": {
      "phone": "123-456-7890",
      "email": "jobs@789corp.com"
    }
  },
  {
    "id": "006",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/5/51/Logo_twitter_wordmark_1000.png",
    "job_title": "Graphic Designer",
    "company_name": "Twitter",
    "remote_or_onsite": "Remote",
    "location": "Miami, US",
    "fulltime_or_parttime": "Part-time",
    "salary": "25k - 30k",
    "job_description": "We are seeking a Data Scientist to join our growing team. The ideal candidate should have experience in statistical analysis, machine learning, and data visualization. In this role, you will collaborate with other teams to develop and deploy machine learning models and algorithms that drive business insights and decisions.",
    "job_responsibility": "Develop and deploy machine learning models and algorithms that drive business insights and decisions. Collaborate with other teams to understand business needs and identify opportunities to leverage data. Analyze data using statistical methods and provide insights and recommendations to stakeholders. Communicate findings and recommendations to technical and non-technical stakeholders.",
    "educational_requirements": "Bachelor's degree in Graphic Design or related field",
    "experiences": "3+ years of experience in graphic design",
    "contact_information": {
      "phone": "123-456-7890",
      "email": "jobs@xyzcorp.com"
    }
  }
]
